Amiya200/stm32_water_tank/Core/Src/screen.c
            case UI_TIMER_EDIT_SLOT_OFF_M: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d OFF Mn:%02d", currentSlot + 1, edit_timer_off_m);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ENABLE: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Enable Slot %d?", currentSlot + 1);
                snprintf(l1,sizeof(l1),">YES=Sel Back");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== SEARCH ==== */
            case UI_SEARCH_EDIT_GAP: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit Gap: %3ds", edit_search_gap_s);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_SEARCH_EDIT_DRY: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit Dry: %3ds", edit_search_dry_s);
                snprintf(l1,sizeof(l1),">UpDn   Save");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== COUNTDOWN ==== */
            case UI_COUNTDOWN_EDIT_MIN: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Set Min: %3u", edit_countdown_min);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_COUNTDOWN_EDIT_REP: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Set Reps: %3u", edit_countdown_rep);
                snprintf(l1,sizeof(l1),">UpDn   Start");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== TWIST ==== */
            case UI_TWIST_EDIT_ON: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T ON:%3ds", edit_twist_on_s);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TWIST_EDIT_OFF: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T OFF:%3ds", edit_twist_off_s);
                snprintf(l1,sizeof(l1),">UpDn   Save");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            default:
                lcd_line0("Not Implemented");
                lcd_line1("                ");
                break;
        }
    }
}

/* ============================
   BUTTON HANDLER
   ============================ */
void Screen_HandleButton(UiButton b)
{
    if (b == BTN_NONE) return;
    refreshInactivityTimer();

    /* ---- SW1 short press → Manual toggle ---- */
    if (b == BTN_RESET) {
        ModelHandle_ToggleManual();
        screenNeedsRefresh = true;
        return;
    }

    /* ================= UP KEY ================= */
    if (b == BTN_UP) {
        switch (ui) {
            case UI_MENU:
                if (menu_idx > 0) menu_idx--;
                break;

            /* Cycle Timer slots */
            case UI_TIMER:
                if (currentSlot < 4) currentSlot++;
                else currentSlot = 0;
                break;

            /* Timer slot edit fields */
            case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  < 23) edit_timer_on_h++;  break;
            case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  < 59) edit_timer_on_m++;  break;
            case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h < 23) edit_timer_off_h++; break;
            case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m < 59) edit_timer_off_m++; break;

            /* Search */
            case UI_SEARCH_EDIT_GAP: edit_search_gap_s += 5; break;
            case UI_SEARCH_EDIT_DRY: edit_search_dry_s += 1; break;

            /* Countdown */
            case UI_COUNTDOWN_EDIT_MIN: edit_countdown_min++; break;
            case UI_COUNTDOWN_EDIT_REP: edit_countdown_rep++; break;

            /* Twist */
            case UI_TWIST_EDIT_ON:  if (edit_twist_on_s  < 600) edit_twist_on_s++;  break;
            case UI_TWIST_EDIT_OFF: if (edit_twist_off_s < 600) edit_twist_off_s++; break;

            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= DOWN KEY ================= */
    if (b == BTN_DOWN) {
        switch (ui) {
            case UI_MENU:
                if (menu_idx < (int)(MAIN_MENU_COUNT - 1)) menu_idx++;
                break;

            /* Cycle Timer slots backward */
            case UI_TIMER:
                if (currentSlot > 0) currentSlot--;
                else currentSlot = 4;
                break;

            /* Timer slot edit fields */
            case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  > 0) edit_timer_on_h--;  break;
            case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  > 0) edit_timer_on_m--;  break;
            case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h > 0) edit_timer_off_h--; break;
            case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m > 0) edit_timer_off_m--; break;

            /* Search */
            case UI_SEARCH_EDIT_GAP: if (edit_search_gap_s > 5) edit_search_gap_s -= 5; break;
            case UI_SEARCH_EDIT_DRY: if (edit_search_dry_s > 1) edit_search_dry_s -= 1; break;

            /* Countdown */
            case UI_COUNTDOWN_EDIT_MIN: if (edit_countdown_min > 1) edit_countdown_min--; break;
            case UI_COUNTDOWN_EDIT_REP: if (edit_countdown_rep > 1) edit_countdown_rep--; break;

            /* Twist */
            case UI_TWIST_EDIT_ON:  if (edit_twist_on_s  > 1) edit_twist_on_s--;  break;
            case UI_TWIST_EDIT_OFF: if (edit_twist_off_s > 1) edit_twist_off_s--; break;

            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ================= SELECT KEY ================= */
    if (b == BTN_SELECT) {
        switch (ui) {

            /* === TIMER SLOT TOGGLE === */
            case UI_TIMER:
                timerSlots[currentSlot].enabled = !timerSlots[currentSlot].enabled;
                screenNeedsRefresh = true;
                return;

            case UI_TIMER_SLOT_SELECT:
                ui = UI_TIMER_EDIT_SLOT_ON_H;
                break;

