Amiya200/stm32_water_tank/Core/Src/screen.c
            case UI_TIMER_EDIT_SLOT_ON_H:
                ui = UI_TIMER_EDIT_SLOT_ON_M;
                break;

            case UI_TIMER_EDIT_SLOT_ON_M:
                ui = UI_TIMER_EDIT_SLOT_OFF_H;
                break;

            case UI_TIMER_EDIT_SLOT_OFF_H:
                ui = UI_TIMER_EDIT_SLOT_OFF_M;
                break;

            case UI_TIMER_EDIT_SLOT_OFF_M:
                ui = UI_TIMER_EDIT_SLOT_ENABLE;
                break;

            case UI_TIMER_EDIT_SLOT_ENABLE:
                apply_timer_slot(currentSlot);
                ui = UI_TIMER;
                break;

            /* === SEARCH === */
            case UI_SEARCH:
                if (searchSettings.searchActive)
                    ModelHandle_StopSearch();
                else
                    ModelHandle_StartSearch(edit_search_gap_s, edit_search_dry_s);
                break;

            case UI_SEARCH_EDIT_GAP:
                ui = UI_SEARCH_EDIT_DRY;
                break;

            case UI_SEARCH_EDIT_DRY:
                apply_search_settings();
                ui = UI_SEARCH;
                break;

            /* === TWIST === */
            case UI_TWIST:
                if (twistSettings.twistActive)
                    ModelHandle_StopTwist();
                else
                    ModelHandle_StartTwist(edit_twist_on_s, edit_twist_off_s);
                break;

            case UI_TWIST_EDIT_ON:
                ui = UI_TWIST_EDIT_OFF;
                break;

            case UI_TWIST_EDIT_OFF:
                apply_twist_settings();
                ui = UI_TWIST;
                break;

            /* === COUNTDOWN === */
            case UI_COUNTDOWN:
                if (countdownActive)
                    ModelHandle_StopCountdown();
                else
                    ui = UI_COUNTDOWN_EDIT_MIN;
                break;

            case UI_COUNTDOWN_EDIT_MIN:
                ui = UI_COUNTDOWN_EDIT_REP;
                break;

            case UI_COUNTDOWN_EDIT_REP:
                ui = UI_COUNTDOWN_TOGGLE;
                break;

            case UI_COUNTDOWN_TOGGLE: {
                uint32_t seconds = (uint32_t)edit_countdown_min * 60u;
                if (seconds == 0) seconds = 60;
                if (edit_countdown_rep == 0) edit_countdown_rep = 1;
                apply_countdown_settings();
                ModelHandle_StartCountdown(seconds, (uint16_t)edit_countdown_rep);
                ui = UI_COUNTDOWN;
                break;
            }

            default:
                menu_select();
                break;
        }

        screenNeedsRefresh = true;
        return;
    }
}

/* ============================
   SWITCH POLLING + LONG PRESS
   ============================ */
/* ============================
   SWITCH POLLING + LONG PRESS
   ============================ */
void Screen_HandleSwitches(void){
    static const struct {
        GPIO_TypeDef* port;
        uint16_t pin;
        UiButton btn;
        uint16_t ledPin;
    } switchMap[] = {
        {SWITCH1_GPIO_Port, SWITCH1_Pin, BTN_RESET,  LED1_Pin}, // Manual
        {SWITCH2_GPIO_Port, SWITCH2_Pin, BTN_SELECT, LED2_Pin}, // Select
        {SWITCH3_GPIO_Port, SWITCH3_Pin, BTN_UP,     LED3_Pin}, // Up
        {SWITCH4_GPIO_Port, SWITCH4_Pin, BTN_DOWN,   LED4_Pin}  // Down / Back
    };

    static bool prev[4] = {true,true,true,true};
    static uint32_t pressStart[4] = {0,0,0,0};

    for (int i=0; i<4; i++){
        bool pressed = (HAL_GPIO_ReadPin(switchMap[i].port, switchMap[i].pin) == GPIO_PIN_RESET);

        if (pressed && prev[i]) {
            prev[i] = false;
            pressStart[i] = HAL_GetTick();
        }
        else if (!pressed && !prev[i]) {
            uint32_t pressDuration = HAL_GetTick() - pressStart[i];
            prev[i] = true;

            /* ---- SW3 ≥3s => "Summer Save" burst ---- */
            if (i == 2 && pressDuration >= 3000UL) {
                ModelHandle_TriggerAuxBurst(30);
                lcd_clear();
                lcd_put_cur(0, 0);
                lcd_send_string("Summer Save 30s");
                lcd_put_cur(1, 0);
                lcd_send_string("Relays 2&3 ON");
                HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
            }

            /* ---- SW1 ≥2s => System reset ---- */
            else if (i == 0 && pressDuration > 2000UL) {
                ModelHandle_ManualLongPress();
            }

            /* ---- SW4 ≥2s => Back/menu reset ---- */
            else if (i == 3 && pressDuration > 2000UL) {
                menu_reset();
            }

            /* ---- SW2 (SELECT) short vs long ---- */
            else if (i == 1) {
                if (pressDuration >= 1000UL) {
                    // Long press (≥1s) → edit mode for Timer
                    if (ui == UI_TIMER) {
                        ui = UI_TIMER_SLOT_SELECT;
                        screenNeedsRefresh = true;
                    } else {
                        Screen_HandleButton(switchMap[i].btn);
                    }
                } else {
                    // Short press → normal behavior
                    Screen_HandleButton(switchMap[i].btn);
                }
                HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
            }

            /* ---- Short press for others ---- */
            else {
                HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
                Screen_HandleButton(switchMap[i].btn);
            }
        }
    }
}

